const x = 10, y = '10';

console.log(x == y); // Порівняння значиння x повинно дорівнювати значеню y, може повернути тільки булеве значення, цього оператора потрібно у никати бо він з старої версії на томість використовувати потрібно === ,( в цьому випадку true ).
console.log(x === y); // точне порівняння, може повернути тільки булеве значення, використовується набагато частіше ніж ==, ( тут буде false ).
console.log(x !=y); // Порівняння значиння x НЕПОВИННО дорівнювати значеню y, може повернути тільки булеве значення,цього оператора потрібно у никати бо він з старої версії на томість використовувати потрібно !== , ( в цьому випадку false ).
console.log(x !== y); // точне порівняння, значиння x НЕПОВИННО дорівнювати значеню y,  може повернути тільки булеве значення ( тут буде false ).

const a = 5, b = 4;

console.log(a > b);
console.log(a < b);
console.log(a >= b);
console.log(a <= b);