// const x= 24, y = 5; // Так лучше использовать при небольшом количестве пременных
//
// const x= 24; //
// const y= 5;  // Так лучше когда много

const x= 24, y = 5;
const sum = x + y;
console.log(`Sum ${sum}`);

// const sum // Название sum лучше использовать во время додавания +
// const sub // название sub(от слова subtraction) лучше использовать во время отнимания -
// const mul // название mul(от слова multiplication) лучше использовать во время умножения *
// const div // название div (от слова division, а не от дива в html) лучше использовать во время деления /
// const rem // название rem (от слова reminder) лучше использовать во время получения остачи от деления %, например 24 % 5 остача будет 4